from deeppavlov import build_model

questions = [
    'О чём рассказ?',
    'Кто такой Петер Перг?',
    'Кто осуществляет запись данных?',
]

content = [
    'Гринька и Федя собрались на луг за щавелём. И Ваня пошёл с ними.  -  Ступай, ступай,- сказала бабушка.- Наберёшь '
    'щавелю - зелёные щи сварим.  Весело было на лугу. Траву ещё не скосили. Кругом далеко-далеко пестрели цветы -  и '
    'красные, и синие, и белые. Весь луг был в цветах.  Ребятишки разбрелись по лугу и стали рвать щавель. Всё дальше '
    'и дальше уходили они по высокой траве, по весёлым цветам.  Вдруг Федя сказал:  - Что-то здесь пчёл много!  -  '
    'Правда, здесь пчёл много,- сказал и Ваня.- Всё время гудят.  -  Эй, ребята,- закричал издали Гринька, '
    '-  поворачивай обратно! Мы на пчельник забрели  -   вон ульи стоят!  Вокруг колхозного пчельника густо росли '
    'липы и акации. А сквозь ветки были видны маленькие пчелиные домики.  Ребята,   отступай!  скомандовал Гринька. - '
    'Только тихо, руками не махать, а то пчёлы закусают.   Ребятишки осторожно пошли от пчельника. Они шагали тихо и '
    'руками не махали, чтобы не сердить пчёл. И совсем было ушли от пчёл, но тут Ваня услышал, что кто-то плачет. Он '
    'оглянулся на товарищей, но Федя не плакал и Гринька не плакал, а плакал маленький Васятка, сын пчеловода. Он '
    'забрёл на пчельник и стоял среди ульев, а пчёлы так и налетали на него.   Ребята!  крикнул Ваня. -   Васятку '
    'пчёлы закусали!  - А что, нам за ним на пчельник идти? — ответил Гринька.— И нас пчёлы закусают.  Надо его отца '
    'позвать,- сказал Федя. -  Вот пойдём мимо их дома - его отцу скажем.  И оба пошли дальше. А Ваня вернулся и '
    'пошёл прямо на пчельник.  -  Иди сюда! -  крикнул он Васятке.  Но Васятка не слышал. Он отмахивался от пчёл и '
    'кричал во весь голос.  Ваня подошёл к Васятке, взял его за руку и повёл с пчельника. До самого дома довёл.  '
    'Васяткина мать выбежала на крыльцо, взяла Васятку на руки:  -  Ах ты непослушный, зачем на пчельник ходил? Вон '
    'как пчёлы искусали! -  Посмотрела на Ваню. - Ах, батюшки, Ванёк, - сказала она - и тебе от пчёл досталось из-за '
    'Васятки! Ну, да ничего, ты не бойся: поболит -  перестанет!  -  Мне ничего, - сказал Ваня.  И пошёл домой. Пока '
    'шёл, у него распухла губа, и веко распухло, и глаз закрылся.  - Ну и хорош! - сказала бабушка. - Это кто же тебя '
    'так разукрасил?  -  Пчёлы,- ответил Ваня.  -  А почему же Гриньку и Федю пчёлы не тронули?  -  Они убежали, '
    'а я Васятку вёл,- сказал Ваня.- А что ж такого? Поболит - перестанет.  Отец пришёл с поля обедать, посмотрел на '
    'Ваню и рассмеялся.  -  Федя с Гринькой от пчёл убежали, - сказала бабушка, - а наш простофиля полез Васятку '
    'спасать. Вот бы мама сейчас его увидела - что бы она сказала?  Ваня глядел на отца одним глазом и ждал: что '
    'сказала бы мама?  А отец улыбнулся и похлопал Ваню по плечу:  - Она бы сказала: молодец у меня сынок! Вот бы что '
    'она сказала!',
    'Вена, 1920 год. На город обрушивается серия загадочных жестоких убийств, которые расследует суровый '
    'детектив-одиночка Петер Перг. Следуя за мистически неуловимым серийным убийцей, он узнает в жертвах своих бывших '
    'сослуживцев.',
    'Порядок работы с полевыми электроразведочными данными при использованием программного обеспечения '
    'SGS-TEM/FastSnap. 1) Запись данных Запись данных осуществляет оператор станции. При работе на площади всегда '
    'необходимо вести журнал оператора электроразведочной станции и составлять ежедневный рапорт оператора. 2) '
    'Первичная оценка записанных данных На этапе записи данных оператор должен проверить правильность записанных '
    'данных. Обязательно при завершении записи собирать итоговую кривую в программе TEM-Processing. При каких-либо '
    'неустранимых помехах при записи обязательно указывать это в журнале оператора электроразведочной станции. 3) '
    'Подготовка данных для передачи в офис предприятия Подготовку данных осуществляет оператор станции. Оператор '
    'выбирает из проекта данные ещё не отправленные в офис предприятия. Подготовка данных производится в программе '
    'ProjectManager. В меню «Действия» пункт «Экспорт данных для ftp» (Приложение 1). 4) Передача данных в офис '
    'Передача данных в офис осуществляется назначенным сотрудником в полевом отряде, назначение проводит начальник '
    'отряда или полевой партии. Передача материалов возможна двумя способами:     1. на физическом носителе     2. '
    'через ftp сервер предприятия (адрес сервера ftp.ierp.ru). При передаче через ftp сервер необходимо соблюдать '
    'определённые правила добавления материала:     • Материал размещается в каталоге с названием площади в '
    'подкаталоге метода исследования (мЗСБ или ЗСБ)     • При каждом добавлении материала должен создаваться каталог '
    'с датой добавления материала на сервер в формате ГГГГ-ММ-ДД (например 2023-10-24).     • В случае обрыва связи '
    'при передаче данных и не возможности догрузки файла этот файл следует удалить и отправить заново.  Структура '
    'каталогов данных для передачи. Каталог Содержание Data mdb файл проекта TXT txt файлы за выбранный период RB rb '
    'файлы за выбранный период Curves tqq файлы (все имеющиеся) Journal Ежедневный рапорт оператора и Журнал '
    'оператора электроразведочной станции  5) Оповещение о передаче данных После передачи данных необходимо '
    'оповестить сотрудников офиса ответственного за площадь геофизика (далее геофизика). Ответственный геофизик '
    'должен оповестить администратора базы данных (далее администратор БД). 6) Проверка целостности переданных данных '
    'Администратор БД проверяет целостность переданных данных. В случае неполноты данных администратор БД через '
    'геофизика запрашивает недостающие данные. Этот процесс повторяется до получения в офисе всех необходимых данных. '
    '7) Размещение полученных данных на сервере предприятия После получения данных администратор БД размещает их на '
    'сервере предприятия. Ежедневный рапорт оператора и журнал оператора электроразведочной станции размещаются на '
    'сервере по адресу \\10.76.10.18\Share\DataRoom\Журналы операторов\Название площади. Название каталога площади '
    'совпадает с именем проекта на сервере предприятия. 8) Оповещение о приёме переданных данных После размещения '
    'данных на сервере предприятия, администратор БД должен оповестить геофизика о приёме данных и их целостности. '
    'Геофизик проверяет полученный материал на наличие брака, при первичной оценке может быть использована программа '
    'EMQC. В случае обнаружения брака в материале, геофизик оповещает начальника отряда и главного геофизика '
    'предприятия, после чего принимается решение о дальнейших действиях полевой партии. Также рекомендуется геофизику '
    'оповещать ответственного за передачу данных о успешной приёмке данных в офисе предприятия, чтобы обеспечить '
    'своевременное информирование о завершении этапа передачи данных и их пригодности для дальнейшего анализа и '
    'использования.  9) Итоговая приёмка материала При завершении записи всех точек наблюдения на площади работ '
    'необходимо провести передачу в офис предприятия всех недостающих данных. Также ответственный геофизик должен '
    'знать где расположена следующая информация по объекту работ: скорее всего есть какие-то ещё документы я могу '
    'быть не в курсе     • ГИС составляющая проекта     • Акты переноса точек наблюдений (при наличии таких)     • '
    'Акты приёма полевого материала стороной заказчика В порядке предложения Хранить данные по площади рекомендуется '
    'на сервере предприятия по пути  \\10.76.10.18\Share\DataRoom\Площади\ Название площади. Название площади '
    'совпадает с именем проекта на сервере предприятия. После получения всех необходимых данных ответственный '
    'геофизик должен оповестить главного геофизика о  наличии всех необходимых полевых данных на серверах '
    'предприятия. Приложение 1. Памятка подготовки для передачи полевого материала в программе Project Manager. После '
    'открытия ProjectManager получаем доступ на изменение БД . Открываем список проектов . Выбираем нужный нам '
    'проект. Идём в меню действия выбираем пункт Экспорт данных для ftp.  Папка экспорта данных – в папке будут '
    'сохраняться папки с архивами по датам подготовки данных. Итоговая папка - обычно папка с названием в виде числа '
    'архивации данных. Путь до архиватора – поддерживаются два архиватора winrar и 7zip при первом запуске архивации '
    'следует указать путь до одного из них. Имя итогового архива – название архива в итоговой папке. Размер архива. '
    'Т.к. данные обычно довольно объёмные и спутниковая связь не стабильна данные при архивации лучше разбивать на '
    'части (рекомендуемый размер тома 300-400 Мб). Это даст возможность не перекачивать весь объём информации заново '
    'в случае разрыва связи. Можно будет дослать только не переданнные части. Даты. В этом разделе указываются даты, '
    'за которые Вы хотите сформировать архив для отправки данных. В архив будут добавлены: Ваш текущий mdb файл, '
    'txt файлы за указанные даты, rb файлы за указанные даты. Номера стоянок. Можно сформировать данные на отправку '
    'по номерам отписанных стоянок. В архив добавляются: Ваш текущий mdb файл, txt файлы указанных стоянок, '
    'rb файлы указанных стоянок. После указания всех настроек нажимаем Экспорт. Если была установлена галочка Открыть '
    'папку после окончания экспорта, то после завершения формирования архива будет открыта папка с готовым к отправке '
    'на ftp архивом. В папке будут многотомный архив, служебный файл CRC32List.txt, служебный файл DateRange, '
    'папка journal. В папку journal необходимо скопировать Ежедневный рапорт оператора и Журнал оператора '
    'электроразведочной станции. В эту же папку необходимо добавить сжатую папку Curves проекта. Теперь данные '
    'полностью готовы к отправке на сервер ftp. '
]

if __name__ == '__main__':
    model = build_model('squad_ru_bert', download=True)

    answer = model([content[0]], [questions[0]])
    print(answer)

    answer = model([content[1]], [questions[1]])
    print(answer)

    answer = model([content[2]], [questions[1]])
    print(answer)
